; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v5 - type_2 ?v8 - type_3)
 	      (pred_3 ?v2 - object ?v8 - type_3)
	      (pred_2 ?v5 - type_2 ?v1 - type_1)
	      (pred_1 ?v5 - type_2 ?v2 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v5 - type_2 ?v3 ?v6 - type_3)
       :precondition (and  (pred_4 ?v5 ?v3))
       :effect (and  (pred_4 ?v5 ?v6)
		     (not (pred_4 ?v5 ?v3))))

   (:action op_2
       :parameters (?v5 - type_2 ?v4 - object ?v7 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v7) (pred_4 ?v5 ?v7) (pred_2 ?v5 ?v1))
       :effect (and (pred_1 ?v5 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v7)) 
		    (not (pred_2 ?v5 ?v1))))

   (:action op_3
       :parameters (?v5 - type_2 ?v4 - object ?v7 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v4 ?v1) (pred_4 ?v5 ?v7))
       :effect (and (pred_3 ?v4 ?v7)
		    (pred_2 ?v5 ?v1)
		    (not (pred_1 ?v5 ?v4 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_12 obj_02 - type_2
obj_06 obj_03 obj_09 obj_07 - type_1
obj_11 obj_04 obj_01 - type_3
obj_10 obj_08 obj_05 - object)
(:init
(pred_4 obj_12 obj_04)
(pred_2 obj_12 obj_06)
(pred_2 obj_12 obj_03)
(pred_4 obj_02 obj_11)
(pred_2 obj_02 obj_09)
(pred_2 obj_02 obj_07)
(pred_3 obj_10 obj_04)
(pred_3 obj_08 obj_01)
(pred_3 obj_05 obj_11)
)
(:goal
(and
(pred_3 obj_10 obj_11)
(pred_3 obj_08 obj_04)
(pred_3 obj_05 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_12 obj_04) (pred_4 obj_02 obj_04))))
  )
)
)

; plan
1. (op_2 obj_02 obj_05 obj_11 obj_07)
   deleted: (pred_3 obj_05 obj_11) (pred_2 obj_02 obj_07)
   added: (pred_1 obj_02 obj_05 obj_07)
   goals met: 0 of 3
2. (op_2 obj_12 obj_10 obj_04 obj_03)
   deleted: (pred_3 obj_10 obj_04) (pred_2 obj_12 obj_03)
   added: (pred_1 obj_12 obj_10 obj_03)
   goals met: 0 of 3
3. (op_1 obj_12 obj_04 obj_11)
   deleted: (pred_4 obj_12 obj_04)
   added: (pred_4 obj_12 obj_11)
   goals met: 0 of 3
4. (op_1 obj_02 obj_11 obj_01)
   deleted: (pred_4 obj_02 obj_11)
   added: (pred_4 obj_02 obj_01)
   goals met: 0 of 3
5. (op_3 obj_12 obj_10 obj_11 obj_03)
   deleted: (pred_1 obj_12 obj_10 obj_03)
   added: (pred_3 obj_10 obj_11) (pred_2 obj_12 obj_03)
   goals met: 1 of 3
6. (op_2 obj_02 obj_08 obj_01 obj_09)
   deleted: (pred_3 obj_08 obj_01) (pred_2 obj_02 obj_09)
   added: (pred_1 obj_02 obj_08 obj_09)
   goals met: 1 of 3
7. (op_1 obj_02 obj_01 obj_04)
   deleted: (pred_4 obj_02 obj_01)
   added: (pred_4 obj_02 obj_04)
   goals met: 1 of 3
8. (op_3 obj_02 obj_05 obj_04 obj_07)
   deleted: (pred_1 obj_02 obj_05 obj_07)
   added: (pred_3 obj_05 obj_04) (pred_2 obj_02 obj_07)
   goals met: 2 of 3
9. (op_3 obj_02 obj_08 obj_04 obj_09)
   deleted: (pred_1 obj_02 obj_08 obj_09)
   added: (pred_3 obj_08 obj_04) (pred_2 obj_02 obj_09)
   goals met: 3 of 3
